/******************************************************************************
 * ht2992.h -- Hardware Definition Module for the Hytec VSD 2992 Serial
 *             Highway Link Driver.
 *
 *-----------------------------------------------------------------------------
 * AUTHORS:
 *	Eric Bjorklund and Rozelle Wright (LANL)
 *
 *	Adapted from the work of Marty Wise (CEBAF) and
 *	Ying Wu (Duke University)
 *
 * Origination Date:  8/10/94
 *
 *-----------------------------------------------------------------------------
 * MODIFICATION LOG:
 *
 * 08-10-94  bjo,rmw	Initial Release
 * 06-05-95  bjo	Added error recording
 * 12-14-95  bjo	Update for EPICS R3.12
 * 
 *****************************************************************************/

/************************************************************************/
/*  Configuration Constants						*/
/************************************************************************/

/*=====================
 * The following constants identify the hardware as a Hytec VSD2992
 * serial highway driver.
 */
#define	BRANCH_TYPE		SERIAL	/* Serial Highway Driver	*/
#define	HYTEC_ID		0xff7f 	/* Hytec Manufacturer Id	*/
#define VSD_2992		2992	/* Module Id Number		*/

/*====================
 * The following constants are default hardware addresses, and interrupt
 * levels for the VSD2992 card.
 */
#define HT2992_ADDRESS		0xDE00	/* Base address for Branch 0	*/
#define	HT2992_IRQ_LEVEL	3	/* Interrupt Request Level	*/
#define	HT2992_IVEC_BASE	0X80	/* Vector address for Branch 0	*/
#define	HT2992_NUM_CARDS	7	/* Maximum number of cards	*/

/*=====================
 * The following constants are used to determine whether we should wait for
 * command completion by busy-waiting or by taking an interrupt on "highway
 * ready."
 *
 * NOTE: These constants represent reasonable values for the MV167 board.
 * They may need to be adjusted if a faster CPU is used.
 */
#define	MAX_BUSYWAIT		1000000	/* Max loops waiting for ready	     */
#define	BUSYWAIT_CUTOFF		100	/* Cutoff point for busy-wait method */


/************************************************************************/
/*  Header Files							*/
/************************************************************************/

#include	<intLib.h>		/* Interrupt service library	*/
#include	<iv.h>			/* Interrupt vector definitions	*/
#include	<rebootLib.h>		/* Reboot hook definitions	*/
#include	<vme.h>			/* VME address descriptions	*/
#include	<sys/types.h>		/* Arch-independant type defs	*/

/************************************************************************/
/* Register Definitions for the Hytec VSD2992 Serial Highway Driver	*/
/************************************************************************/

typedef struct /* ht2992_read_registers */ {
  uint16_t volatile  rdid;	/* 00 -- Manufacturer id	  	*/
  uint16_t volatile  rmod;	/* 02 -- Module code		  	*/
  uint16_t volatile  rcsr;	/* 04 -- Controller status register	*/
  uint16_t volatile  unused06;	/* 06					*/
  uint16_t volatile  unused08;	/* 08					*/
  uint16_t volatile  rlmk;	/* 0A -- LAM mask register		*/
  uint16_t volatile  rvec;	/* 0C -- Interrupt vector register	*/
  uint16_t volatile  rlst;	/* 0E -- LAM status register		*/
  uint16_t volatile  unused10;	/* 10					*/
  uint16_t volatile  unused12;	/* 12					*/
  uint16_t volatile  unused14;	/* 14					*/
  uint16_t volatile  rsts;	/* 16 -- Status from last reply		*/
  uint16_t volatile  rdst;	/* 18 -- Demand status register		*/
  uint16_t volatile  rddb;	/* 1A -- Low-order data (16-bits)	*/
  uint16_t volatile  rddt;	/* 1C -- High-order data (8-bits)	*/
  uint16_t volatile  rdip;	/* 1E -- Read dump store & inc pointer	*/
  uint16_t volatile  rdpt;	/* 20 -- Read dump store pointer	*/
  uint16_t volatile  rups;	/* 22 -- U-port settings		*/
  uint16_t volatile  unused24;	/* 24					*/
  uint16_t volatile  unused26;	/* 26					*/
  uint16_t volatile  unused28;	/* 28					*/
  uint16_t volatile  unused2A;	/* 2A					*/
  uint16_t volatile  unused2C;	/* 2C					*/
  uint16_t volatile  unused2E;	/* 2E					*/
  uint16_t volatile  rtcs;	/* 30 -- Read crate (loop-back)		*/
  uint16_t volatile  rtxn;	/* 32 -- Read slot (loop-back)		*/
  uint16_t volatile  rtxa;	/* 34 -- Read sub-address (loop-back)	*/
  uint16_t volatile  rtxf;	/* 36 -- Read function code (loop-back)	*/
  uint16_t volatile  rdt4;	/* 38 -- Read data byte 4 (6-bit)	*/
  uint16_t volatile  rdt3;	/* 3A -- Read data byte 3 (6-bit)	*/
  uint16_t volatile  rdt2;	/* 3C -- Read data byte 2 (6-bit)	*/
  uint16_t volatile  rdt1;	/* 3E -- Read data byte 1 (6-bit)	*/
} ht2992_read_registers;

typedef struct /* ht2992_write_registers */ {
  uint16_t volatile  wvec;	/* 00 -- Interrupt vector register	*/
  uint16_t volatile  unused02;	/* 02					*/
  uint16_t volatile  wien;	/* 04 -- Controller status register	*/
  uint16_t volatile  unused06;	/* 06					*/
  uint16_t volatile  unused08;	/* 08					*/
  uint16_t volatile  wlmk;	/* 0A -- LAM mask register		*/
  uint16_t volatile  wclm;	/* 0C -- Clear LAM mask register	*/
  uint16_t volatile  wscl;	/* 0E -- Selective clear LAM register	*/
  uint16_t volatile  wcll;	/* 10 -- Clear LAM register		*/
  uint16_t volatile  wscm;	/* 12 -- Selective clear LAM mask reg	*/
  uint16_t volatile  wssm;	/* 14 -- Selective set LAM mask reg	*/
  uint16_t volatile  wnaf;	/* 16 -- Write NAF			*/
  uint16_t volatile  wtca;	/* 18 -- Write crate			*/
  uint16_t volatile  wtdb;	/* 1A -- Low order data (16 bits)	*/
  uint16_t volatile  wtdt;	/* 1C -- High order data (8 bits)	*/
  uint16_t volatile  wdsf;	/* 1E -- Enable dump store		*/
  uint16_t volatile  wdsp;	/* 20 -- Write dump store pointer	*/
  uint16_t volatile  wups;	/* 22 -- U-port setting			*/
  uint16_t volatile  wfif;	/* 24 -- Write FIFO			*/
  uint16_t volatile  wlbf;	/* 26 -- Enable loopback		*/
} ht2992_write_registers;

